# read design
read_verilog -sv include/my_pkg.svh
read_verilog -sv src/alu.sv
read_verilog -sv top.sv
hierarchy -check -top top

# high-level synthesis
proc; opt; fsm; opt; memory; opt

write_json top.json
