# read design
read_verilog -sv -formal include/my_pkg.svh
read_verilog -sv -formal src/alu.sv
read_verilog -sv -formal top.sv
hierarchy -check -top top

# high-level synthesis
proc; opt; fsm; opt; memory; opt

write_json top.json
