# read design
read_verilog -sv dff_sync_2.sv
hierarchy -check -top dff_sync_2

# high-level synthesis
proc; opt; fsm; opt; memory; opt

# export to json file
write_json dff_sync_2.json
